In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv('train.csv')

In [ ]:
titanic.shape

(891, 12)

In [ ]:
test = pd.read_csv('test.csv')
test.shape

(418, 11)

In [ ]:
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
ports = pd.get_dummies(titanic.Embarked, prefix = 'Embarked')
ports.head()

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [ ]:
titanic = titanic.join(ports)
titanic.drop(['Embarked'],axis = 1,inplace = True)

In [ ]:
titanic.head()

   PassengerId  Survived  Pclass  ... Embarked_C Embarked_Q  Embarked_S
0            1         0       3  ...          0          0           1
1            2         1       1  ...          1          0           0
2            3         1       3  ...          0          0           1
3            4         1       1  ...          0          0           1
4            5         0       3  ...          0          0           1

[5 rows x 14 columns]

In [ ]:
titanic.Sex = titanic.Sex.map({'male':0, 'female':1})

In [ ]:
y = titanic.Survived.copy()
X = titanic.drop(['Survived'], axis = 1)

In [ ]:
X.drop(['Cabin','Ticket','Name','PassengerId'], axis = 1, inplace = True)

In [ ]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      891 non-null    int64
 1   Sex         891 non-null    int64
 2   Age         714 non-null    float64
 3   SibSp       891 non-null    int64
 4   Parch       891 non-null    int64
 5   Fare        891 non-null    float64
 6   Embarked_C  891 non-null    uint8
 7   Embarked_Q  891 non-null    uint8
 8   Embarked_S  891 non-null    uint8
dtypes: float64(2), int64(4), uint8(3)
memory usage: 44.5 KB

In [ ]:
X.isnull().values.any()

True

In [ ]:
X[pd.isnull(X).any(axis = 1)]

     Pclass  Sex  Age  SibSp  ...     Fare  Embarked_C  Embarked_Q  Embarked_S
5         3    0  NaN      0  ...   8.4583           0           1           0
17        2    0  NaN      0  ...  13.0000           0           0           1
19        3    1  NaN      0  ...   7.2250           1           0           0
26        3    0  NaN      0  ...   7.2250           1           0           0
28        3    1  NaN      0  ...   7.8792           0           1           0
..      ...  ...  ...    ...  ...      ...         ...         ...         ...
859       3    0  NaN      0  ...   7.2292           1           0           0
863       3    1  NaN      8  ...  69.5500           0           0           1
868       3    0  NaN      0  ...   9.5000           0           0           1
878       3    0  NaN      0  ...   7.8958           0           0           1
888       3    1  NaN      1  ...  23.4500           0           0           1

[177 rows x 9 columns]

In [ ]:
X.Age.fillna(X.Age.mean(), inplace = True)

In [ ]:
X.isnull().values.any()

False

In [ ]:
from sklearn.model_selection import train_test_split
X_train,X_valid,y_train,y_valid = train_test_split(X,y, test_size = 0.2, random_state = 7)

In [ ]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()

In [ ]:
model.fit(X_train,y_train)

/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
model.score(X_train,y_train)

0.8089887640449438

In [ ]:
model.score(X_valid,y_valid)

0.7541899441340782